[
    {
        "title": "Cafe Recommendation System",
        "year": "2024",
        "image": "https://www.shutterstock.com/image-vector/street-cafe-shop-old-french-600nw-1780106321.jpg",
        "description": "The Cafe Recommender System is a personalized recommendation engine that helps users discover cafes based on user preferences, sentiment analysis, and location-based filtering. Using data from the Yelp Academic Dataset, the system integrates collaborative filtering, sentiment analysis, and geospatial distance calculations to generate highly relevant recommendations.        "
    },
    {
        "title": "Recipe EDA and Rating Predictions",
        "year": "2024",
        "image": "https://media.istockphoto.com/id/1473037351/vector/book-cook-food-cookbook-recipe-ingredients-composition-concept-vector-graphic-design.jpg?s=612x612&w=0&k=20&c=2Y0V-2LqI4nzuGbjMGY56s8ENiFrhhTI7xZqTeHCgFg=",
        "description": "This project analyzes recipe data from food.com containing 83,782 recipes and 731,927 reviews to uncover trends in preparation time, nutrition, and user ratings. The study involves data cleaning, exploratory data analysis (EDA), and missing data analysis, revealing insights like lower sodium recipes receiving higher ratings. I also built a predictive model to estimate recipe ratings based on ingredients, nutrition, and cooking time. "
    },
    {
        "title": "Weather App",
        "year": "2024",
        "image": "https://thumbs.dreamstime.com/b/cloud-rain-drops-shining-sun-icon-weather-hand-drawn-cartoon-clip-art-isolated-white-90791583.jpg",
        "description": "This project is a web-based weather application built using Django and Bootstrap. The app fetches and displays the current weather and a forecast for the user's location based on their IP address. It provides key weather data, including temperature, humidity, wind speed, pressure, and sunrise/sunset times for the current and next day."
    },
    {
        "title": "Ethereum Predictive Model",
        "year": "2023",
        "image": "https://watcher.guru/news/wp-content/uploads/2025/01/ethereum-price-predction-main.jpg",
        "description": "I predicted Ethereum’s closing price and price trends using machine learning. Data preprocessing included 10-minute aggregation, log-transforming volume, and MinMax scaling. A polynomial linear regression (degree 4) was used first, followed by a decision tree regressor, which improved accuracy. I also built a decision tree classifier to predict price increases with moderate accuracy. The project involved hyperparameter tuning, feature importance analysis, and performance visualization."
    },
    {
        "title": "Statistical Language Model",
        "year": "2023",
        "image": "https://eu-images.contentstack.com/v3/assets/blt6b0f74e5591baa03/bltc4d876084c0f0d3c/63197bc5556275209a4b6830/2016.jpg",
        "description": "Created a series of language models for processing and generating text. This includes functions to fetch and tokenize a book from a URL, and various classes for different types of language models: UniformLM, UnigramLM, and NGramLM. The UniformLM and UnigramLM models calculate probabilities based on token frequency and generate random text based on these probabilities. The NGramLM model works with n-grams (sequences of n words), calculating conditional probabilities for word sequences and using a recursive approach to handle higher-order n-grams. "
    },
    {
        "title": "Loan Approval EDA",
        "year": "2021",
        "image": "https://media.istockphoto.com/id/1413481802/vector/approved-credit-bill-good-credit-score-receiving-loan-approval-from-bank-personal-finance.jpg?s=612x612&w=0&k=20&c=Nkcl92YeB6pcgo6MUo5YESYtUSoY0nyAo3YSi8FtiNs=",
        "description": "I examined how employment length, income, and loan amount impact loan approval rates for young (18-28) vs. mid-career adults (28-38), focusing on education level. Using scatter plots and a categorical bar plot, I analyzed key relationships and conducted T-tests for significance. Results showed that education level has little impact on loan amounts, but mid-career adults are significantly more likely to repay loans, likely due to greater financial stability and literacy."
    },
    {
        "title": "RGB Image Processing Toolkit",
        "year": "2023",
        "image": "https://image.spreadshirtmedia.net/image-server/v1/products/T1459A839PA4459PT28D191099845W10000H9149/views/1,width=800,height=800,appearanceId=839,backgroundColor=F2F2F2/cute-pixel-art-heart-heart-love-love-red-sticker.jpg",
        "description": "I implemented an RGBImage class to represent and manipulate RGB images, ensuring proper validation and deep copying of pixel data. I also created an ImageProcessingTemplate class with methods for negating, grayscaling, and rotating images. Additionally, I extended this template to develop StandardImageProcessing and PremiumImageProcessing classes, which introduced cost-based processing and advanced features like chroma keying. The project focused on object-oriented design, deep copying techniques, and efficient pixel manipulation."
    },
    {
        "title": "MNIST Number Classification",
        "year": "2022",
        "image": "https://media.istockphoto.com/id/1219153212/vector/cartoon-set-with-different-numbers.jpg?s=612x612&w=0&k=20&c=PQl96fAwjqDJyh6eXqcuP_IbPsevjPlZts85JeB050c=",
        "description": "This project implements a K-Nearest Neighbors (K-NN) classifier for the MNIST handwritten digit dataset using Java to classify user written numbers. The program loads compressed MNIST image and label data, processes it into a structured format, and applies the Euclidean distance metric to classify test images based on their k-nearest neighbors in the training set. A priority queue is used to efficiently store and retrieve the closest matches. The classifier is tested on a subset of the MNIST dataset, and its accuracy is evaluated."
    },
    {
        "title": "PinPoint",
        "year": "2022",
        "image": "https://img.freepik.com/premium-psd/pinpoint-map-3d-cartoon-illustration_705975-33.jpg",
        "description": "PinPoint is a social location-sharing app that lets you stay connected with friends in real time. Users can drop pins on a map to share favorite restaurants, cafes, hangout spots, or any place they love, making it easy for friends to discover new locations. Friends can see shared pins, add comments, and set meet-up plans in the app. ."
    },
    {
        "title": "Budget App",
        "year": "2022",
        "image": "https://img.freepik.com/premium-vector/piggy-bank-with-coin-cartoon-illustration-flat-vector-isolated-object_374761-124.jpg",
        "description": "TravelBudget is a practical app designed to help you manage and track your spending during vacations. You can easily log your expenses, categorize purchases (e.g., food, transportation, activities), and monitor your overall spending in real-time. The app also features a built-in currency converter, allowing you to view prices in your home currency, helping you stay on top of your budget no matter where you are.."
    },
    {
        "title": "Recipe Book",
        "year": "2021",
        "image": "https://media.istockphoto.com/id/1369712605/vector/cooking-food-in-frying-pan-vector-illustration-of-cut-vegetables-cooked-on-gas-stove-cartoon.jpg?s=612x612&w=0&k=20&c=3H9TU5PosN-vYYFQCahK-RdA695_41QiT90n1re_0j0=",
        "description": "This is personalized digital recipe collection that allows users to create, organize, and share their favorite recipes. The app allows you to upload and save your own recipes, categorize them by meal type, ingredients, or cuisine, and easily search through them. It also includes features for meal planning, where users can select recipes for the week and generate a shopping list based on the ingredients. The app offers the ability to share recipes with friends and family. "
    },
    {
        "title": "Social Media Sentiment Analysis",
        "year": "2024",
        "image": "https://static.vecteezy.com/system/resources/thumbnails/008/693/395/small_2x/set-logo-icon-social-media-hand-drawn-doodle-cartoon-illustration-vector.jpg",
        "description": "This project uses NLP and machine learning to analyze social media posts and gauge public sentiment toward a brand. By scraping data from platforms like Twitter and Instagram, it classifies posts as positive, negative, or neutral. This helps businesses monitor customer perceptions, identify PR issues, and track marketing effectiveness in real-time. Techniques like text preprocessing, tokenization, and sentiment classification (e.g., logistic regression, SVM, LSTM) are used to extract insights from large volumes of unstructured data."
    }
]